add new readme.md with interactive interface
